interop-mock/src/main/resources/whitemesa/soap12/test-rpc/echoFloatArray-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <ns1:echoFloatArray soapenv:encodingStyle="http://www.w3.org/2003/05/soap-encoding" xmlns:ns1="http://example.org/ts-tests">
         <inputFloatArray soapenc:itemType="xsd:float" soapenc:arraySize="3" xsi:type="soapenc:Array" xmlns:soapenc="http://www.w3.org/2003/05/soap-encoding">
            <inputFloatArray id="id0" xsi:type="xsd:float">1.1</inputFloatArray>
            <inputFloatArray id="id1" xsi:type="xsd:float">1.2</inputFloatArray>
            <inputFloatArray id="id2" xsi:type="xsd:float">1.3</inputFloatArray>
         </inputFloatArray>
      </ns1:echoFloatArray>
   </soapenv:Body>
</soapenv:Envelope>